Revit 2026 API

# Concrete Class

---

A static class that provides access to the property names that appear in the Concrete visual asset schema.

SystemObject Autodesk.Revit.DB.VisualConcrete

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Concrete
```
```vb
Public NotInheritable Class Concrete
```
```cpp
public ref class Concrete abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Concrete = class end
```

The Concrete type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Concrete" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Concrete" schema. |
|  | ConcreteBmMap | The property labeled "Image" from the "Concrete" schema. |
|  | ConcreteBrightmode | The property labeled "Weathering" from the "Concrete" schema. |
|  | ConcreteBumpAmount | The property labeled "Amount" from the "Concrete" schema. |
|  | ConcreteBumpMap | The property labeled "Image" from the "Concrete" schema. |
|  | ConcreteColor | The property labeled "Color" from the "Concrete" schema. |
|  | ConcreteFinish | The property labeled "Type" from the "Concrete" schema. |
|  | ConcreteSealant | The property labeled "Sealant" from the "Concrete" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace